# ============== Домашнее задание (занятие 1) ==============

# --------- Задание 1 ----------
# Вывести строку "Hello, world!" (без кавычек) в консоль с помощью функции print.
print("Hello, world!")

# --------- Задание 2 ----------
""" 
Выведите строку в консоли "Я люблю:", а затем 3 пронумерованных пункта с тем, что вам нравится, например:
Я люблю:
1. Фильмы
2. Minecraft
3. Кока-кола
"""
print("Я люблю:")
print("1. Фильмы")
print("2. Баскетбол")
print("3. Велопрогулки")
